<?php 

// Реализуйте функцию isBalanced, которая принимает на вход строку, состоящую только из открывающих 
// и закрывающих круглых скобок, и проверяет является ли эта строка корректной. 
// Пустая строка (отсутствие скобок) считается корректной.

// Строка считается корректной (сбалансированной), если 
// содержащаяся в ней скобочная структура соответствует требованиям:

// Скобки — это парные структуры. У каждой открывающей скобки должна быть соответствующая ей закрывающая скобка.
// Закрывающая скобка не должна идти впереди открывающей. 
// Такой вариант недопустим )(, а вот такой допустим ()().



isBalanced('(())');  // true
isBalanced('((())'); // false

//=========================================================================================
//=========================================================================================
//=========================================================================================


//=======================================MY SOLUTION ==================================================

// BEGIN (write your solution here)
function isBalanced($str){
        $length = strlen($str);
        $leftBrecket = "";
        $rightBrecket = "";
        
        for ($i = 0; $i < $length; $i++ ){
            if($str[$i] == '(') {
                $leftBrecket++;
        } else if ($str[$i] == ')'){
            $rightBrecket++;
        }
        if ($leftBrecket < $rightBrecket ) {
            return false;
        }
    }
    if ($leftBrecket == $rightBrecket){
        return true;
    } else {
        return false;
    }
}
// END

//=======================================MY SOLUTION ==================================================

//=======================================Teacher SOLUTION ==================================================

// BEGIN
function isBalanced($str)
{
    $count = 0;
    for ($i = 0; $i < strlen($str); $i++) {
        $count = $str[$i] === '(' ? $count + 1 : $count - 1;
        if ($count < 0) {
            return false;
        }
    }

    return $count === 0;
}
// END

//=======================================Teacher SOLUTION ==================================================


// так же эта функция isBalanced подходит для следующей задачи:
// Реализуйте функцию checkIfBalanced, которая проверяет балансировку круглых скобок в арифметических выражениях.


// checkIfBalanced('(5 + 6) * (7 + 8)/(4 + 3)'); // => true
// checkIfBalanced('(4 + 3))'); // => false 


//=======================================Teacher SOLUTION ==================================================
// BEGIN
function checkIfBalanced(string $expression): bool
{
    // инициализируем стек
    $stack = [];
    for ($i = 0, $length = strlen($expression); $i < $length; $i++) {
        $curr = $expression[$i];
        if ($curr == '(') {
            array_push($stack, $curr);
        } elseif ($curr == ')') {
            if (empty($stack)) {
                return false;
            }
            array_pop($stack);
        };
    }

    // Если стек оказался пустой после обхода строки, то значит все хорошо
    return count($stack) == 0;
}
// END

//=======================================Teacher SOLUTION ==================================================