<?php

// Реализуйте функцию getMirrorMatrix, которая принимает двумерный массив (матрицу) и возвращает массив, 
// изменённый таким образом, что правая половина матрицы становится зеркальной копией левой половины, 
// симметричной относительно вертикальной оси матрицы. Для простоты условимся, что матрица всегда имеет 
// чётное количество столбцов и количество столбцов всегда равно количеству строк.

$arr = [ //массив матрица из задания
    [11, 12, 13, 14],
    [21, 22, 23, 24],
    [31, 32, 33, 34],
    [41, 42, 43, 44],
];

$arTest = [1,2,3,4]; // тестовый массив для того чтоб посмотреть как изменить массив

//========================================================================================================
//========================================================================================================
//========================================================================================================

//============================================мое решение============================================================

function getMirrorMatrix($arr) { // перебираем входящий и меняем зеркально левую часть как правую и заносим обратно
    $arrResult = [];
    foreach ($arr as $k => $v) {
      $arr1 = halfArr($v);
      $arr2 = array_reverse($arr1);
      $ArrMerg =  array_merge($arr1, $arr2);
      $arrResult[] = $ArrMerg;
    }
    return $arrResult;
}




function halfArr($arr){ //функция возвращает массив который состоит из половины исходного массива
    $length = count($arr);
    $halfLength = $length / 2;
    $res = [];
    for ($i = 0; $i < $halfLength; $i++) {
        $res[] = $arr[$i];
    }
    return $res;
}
//============================================мое решение============================================================

//========================================================================================================
//========================================================================================================
//========================================================================================================



$arr1 = halfArr($arTest);
$arr2 = array_reverse($arr1); // array_reverse Возвращает массив с элементами в обратном порядке

print_r($arr1);
print_r($arr2);

$ArrMerg =  array_merge($arr1, $arr2); // Сливает один или большее количество массивов

print_r($ArrMerg);

//========================================================================================================
//========================================================================================================
//========================================================================================================

//============================================решение учителя============================================================

// BEGIN
function getMirrorMatrix(array $array)
{
    $size = count($array);
    $mirrorArray = [];
    for ($i = 0; $i < $size; $i += 1) {
        for ($j = 0; $j < $size / 2; $j += 1) {
            $mirrorArray[$i][$j] = $array[$i][$j];
            $mirrorArray[$i][$size - $j - 1] = $array[$i][$j];
        }
    }

    return $mirrorArray;
}
// END